andeyqi/CAN_FD/bsp/stm32/stm32f446-st-nucleo/applications/tcan4x5x/TCAN4x5x_Reg.h
// RXESC
#define REG_BITS_MCAN_RXESC_RBDS_8B                 0x00000000
#define REG_BITS_MCAN_RXESC_RBDS_12B                0x00000100
#define REG_BITS_MCAN_RXESC_RBDS_16B                0x00000200
#define REG_BITS_MCAN_RXESC_RBDS_20B                0x00000300
#define REG_BITS_MCAN_RXESC_RBDS_24B                0x00000400
#define REG_BITS_MCAN_RXESC_RBDS_32B                0x00000500
#define REG_BITS_MCAN_RXESC_RBDS_48B                0x00000600
#define REG_BITS_MCAN_RXESC_RBDS_64B                0x00000700
#define REG_BITS_MCAN_RXESC_F1DS_8B                 0x00000000
#define REG_BITS_MCAN_RXESC_F1DS_12B                0x00000010
#define REG_BITS_MCAN_RXESC_F1DS_16B                0x00000020
#define REG_BITS_MCAN_RXESC_F1DS_20B                0x00000030
#define REG_BITS_MCAN_RXESC_F1DS_24B                0x00000040
#define REG_BITS_MCAN_RXESC_F1DS_32B                0x00000050
#define REG_BITS_MCAN_RXESC_F1DS_48B                0x00000060
#define REG_BITS_MCAN_RXESC_F1DS_64B                0x00000070
#define REG_BITS_MCAN_RXESC_F0DS_8B                 0x00000000
#define REG_BITS_MCAN_RXESC_F0DS_12B                0x00000001
#define REG_BITS_MCAN_RXESC_F0DS_16B                0x00000002
#define REG_BITS_MCAN_RXESC_F0DS_20B                0x00000003
#define REG_BITS_MCAN_RXESC_F0DS_24B                0x00000004
#define REG_BITS_MCAN_RXESC_F0DS_32B                0x00000005
#define REG_BITS_MCAN_RXESC_F0DS_48B                0x00000006
#define REG_BITS_MCAN_RXESC_F0DS_64B                0x00000007

// TXBC
#define REG_BITS_MCAN_TXBC_TFQM                     0x40000000

// TXESC
#define REG_BITS_MCAN_TXESC_TBDS_8                  0x00000000
#define REG_BITS_MCAN_TXESC_TBDS_12                 0x00000001
#define REG_BITS_MCAN_TXESC_TBDS_16                 0x00000002
#define REG_BITS_MCAN_TXESC_TBDS_20                 0x00000003
#define REG_BITS_MCAN_TXESC_TBDS_24                 0x00000004
#define REG_BITS_MCAN_TXESC_TBDS_32                 0x00000005
#define REG_BITS_MCAN_TXESC_TBDS_48                 0x00000006
#define REG_BITS_MCAN_TXESC_TBDS_64                 0x00000007

// TSCC
#define REG_BITS_MCAN_TSCC_PRESCALER_MASK           0x000F0000
#define REG_BITS_MCAN_TSCC_COUNTER_ALWAYS_0         0x00000000
#define REG_BITS_MCAN_TSCC_COUNTER_USE_TCP          0x00000001
#define REG_BITS_MCAN_TSCC_COUNTER_EXTERNAL         0x00000002

// TXBAR
#define REG_BITS_MCAN_TXBAR_AR31                    0x80000000
#define REG_BITS_MCAN_TXBAR_AR30                    0x40000000
#define REG_BITS_MCAN_TXBAR_AR29                    0x20000000
#define REG_BITS_MCAN_TXBAR_AR28                    0x10000000
#define REG_BITS_MCAN_TXBAR_AR27                    0x08000000
#define REG_BITS_MCAN_TXBAR_AR26                    0x04000000
#define REG_BITS_MCAN_TXBAR_AR25                    0x02000000
#define REG_BITS_MCAN_TXBAR_AR24                    0x01000000
#define REG_BITS_MCAN_TXBAR_AR23                    0x00800000
#define REG_BITS_MCAN_TXBAR_AR22                    0x00400000
#define REG_BITS_MCAN_TXBAR_AR21                    0x00200000
#define REG_BITS_MCAN_TXBAR_AR20                    0x00100000
#define REG_BITS_MCAN_TXBAR_AR19                    0x00080000
#define REG_BITS_MCAN_TXBAR_AR18                    0x00040000
#define REG_BITS_MCAN_TXBAR_AR17                    0x00020000
#define REG_BITS_MCAN_TXBAR_AR16                    0x00010000
#define REG_BITS_MCAN_TXBAR_AR15                    0x00008000
#define REG_BITS_MCAN_TXBAR_AR14                    0x00004000
#define REG_BITS_MCAN_TXBAR_AR13                    0x00002000
#define REG_BITS_MCAN_TXBAR_AR12                    0x00001000
#define REG_BITS_MCAN_TXBAR_AR11                    0x00000800
#define REG_BITS_MCAN_TXBAR_AR10                    0x00000400
#define REG_BITS_MCAN_TXBAR_AR9                     0x00000200
#define REG_BITS_MCAN_TXBAR_AR8                     0x00000100
#define REG_BITS_MCAN_TXBAR_AR7                     0x00000080
#define REG_BITS_MCAN_TXBAR_AR6                     0x00000040
#define REG_BITS_MCAN_TXBAR_AR5                     0x00000020
#define REG_BITS_MCAN_TXBAR_AR4                     0x00000010
#define REG_BITS_MCAN_TXBAR_AR3                     0x00000008
#define REG_BITS_MCAN_TXBAR_AR2                     0x00000004
#define REG_BITS_MCAN_TXBAR_AR1                     0x00000002
#define REG_BITS_MCAN_TXBAR_AR0                     0x00000001

// TXBCR
#define REG_BITS_MCAN_TXBCR_CR31                    0x80000000
#define REG_BITS_MCAN_TXBCR_CR30                    0x40000000
#define REG_BITS_MCAN_TXBCR_CR29                    0x20000000
#define REG_BITS_MCAN_TXBCR_CR28                    0x10000000
#define REG_BITS_MCAN_TXBCR_CR27                    0x08000000
#define REG_BITS_MCAN_TXBCR_CR26                    0x04000000
#define REG_BITS_MCAN_TXBCR_CR25                    0x02000000
#define REG_BITS_MCAN_TXBCR_CR24                    0x01000000
#define REG_BITS_MCAN_TXBCR_CR23                    0x00800000
#define REG_BITS_MCAN_TXBCR_CR22                    0x00400000
#define REG_BITS_MCAN_TXBCR_CR21                    0x00200000
#define REG_BITS_MCAN_TXBCR_CR20                    0x00100000
#define REG_BITS_MCAN_TXBCR_CR19                    0x00080000
#define REG_BITS_MCAN_TXBCR_CR18                    0x00040000
#define REG_BITS_MCAN_TXBCR_CR17                    0x00020000
#define REG_BITS_MCAN_TXBCR_CR16                    0x00010000
#define REG_BITS_MCAN_TXBCR_CR15                    0x00008000
#define REG_BITS_MCAN_TXBCR_CR14                    0x00004000
#define REG_BITS_MCAN_TXBCR_CR13                    0x00002000
#define REG_BITS_MCAN_TXBCR_CR12                    0x00001000
#define REG_BITS_MCAN_TXBCR_CR11                    0x00000800
#define REG_BITS_MCAN_TXBCR_CR10                    0x00000400
#define REG_BITS_MCAN_TXBCR_CR9                     0x00000200
#define REG_BITS_MCAN_TXBCR_CR8                     0x00000100
#define REG_BITS_MCAN_TXBCR_CR7                     0x00000080
#define REG_BITS_MCAN_TXBCR_CR6                     0x00000040
#define REG_BITS_MCAN_TXBCR_CR5                     0x00000020
#define REG_BITS_MCAN_TXBCR_CR4                     0x00000010
#define REG_BITS_MCAN_TXBCR_CR3                     0x00000008
#define REG_BITS_MCAN_TXBCR_CR2                     0x00000004
#define REG_BITS_MCAN_TXBCR_CR1                     0x00000002
#define REG_BITS_MCAN_TXBCR_CR0                     0x00000001

