andeyqi/CAN_FD/bsp/stm32/stm32f446-st-nucleo/applications/tcan4x5x/TCAN4x5x_Reg.h
// TXBTIE
#define REG_BITS_MCAN_TXBTIE_TIE31                  0x80000000
#define REG_BITS_MCAN_TXBTIE_TIE30                  0x40000000
#define REG_BITS_MCAN_TXBTIE_TIE29                  0x20000000
#define REG_BITS_MCAN_TXBTIE_TIE28                  0x10000000
#define REG_BITS_MCAN_TXBTIE_TIE27                  0x08000000
#define REG_BITS_MCAN_TXBTIE_TIE26                  0x04000000
#define REG_BITS_MCAN_TXBTIE_TIE25                  0x02000000
#define REG_BITS_MCAN_TXBTIE_TIE24                  0x01000000
#define REG_BITS_MCAN_TXBTIE_TIE23                  0x00800000
#define REG_BITS_MCAN_TXBTIE_TIE22                  0x00400000
#define REG_BITS_MCAN_TXBTIE_TIE21                  0x00200000
#define REG_BITS_MCAN_TXBTIE_TIE20                  0x00100000
#define REG_BITS_MCAN_TXBTIE_TIE19                  0x00080000
#define REG_BITS_MCAN_TXBTIE_TIE18                  0x00040000
#define REG_BITS_MCAN_TXBTIE_TIE17                  0x00020000
#define REG_BITS_MCAN_TXBTIE_TIE16                  0x00010000
#define REG_BITS_MCAN_TXBTIE_TIE15                  0x00008000
#define REG_BITS_MCAN_TXBTIE_TIE14                  0x00004000
#define REG_BITS_MCAN_TXBTIE_TIE13                  0x00002000
#define REG_BITS_MCAN_TXBTIE_TIE12                  0x00001000
#define REG_BITS_MCAN_TXBTIE_TIE11                  0x00000800
#define REG_BITS_MCAN_TXBTIE_TIE10                  0x00000400
#define REG_BITS_MCAN_TXBTIE_TIE9                   0x00000200
#define REG_BITS_MCAN_TXBTIE_TIE8                   0x00000100
#define REG_BITS_MCAN_TXBTIE_TIE7                   0x00000080
#define REG_BITS_MCAN_TXBTIE_TIE6                   0x00000040
#define REG_BITS_MCAN_TXBTIE_TIE5                   0x00000020
#define REG_BITS_MCAN_TXBTIE_TIE4                   0x00000010
#define REG_BITS_MCAN_TXBTIE_TIE3                   0x00000008
#define REG_BITS_MCAN_TXBTIE_TIE2                   0x00000004
#define REG_BITS_MCAN_TXBTIE_TIE1                   0x00000002
#define REG_BITS_MCAN_TXBTIE_TIE0                   0x00000001

// TXBCIE
#define REG_BITS_MCAN_TXBCIE_CFIE31                 0x80000000
#define REG_BITS_MCAN_TXBCIE_CFIE30                 0x40000000
#define REG_BITS_MCAN_TXBCIE_CFIE29                 0x20000000
#define REG_BITS_MCAN_TXBCIE_CFIE28                 0x10000000
#define REG_BITS_MCAN_TXBCIE_CFIE27                 0x08000000
#define REG_BITS_MCAN_TXBCIE_CFIE26                 0x04000000
#define REG_BITS_MCAN_TXBCIE_CFIE25                 0x02000000
#define REG_BITS_MCAN_TXBCIE_CFIE24                 0x01000000
#define REG_BITS_MCAN_TXBCIE_CFIE23                 0x00800000
#define REG_BITS_MCAN_TXBCIE_CFIE22                 0x00400000
#define REG_BITS_MCAN_TXBCIE_CFIE21                 0x00200000
#define REG_BITS_MCAN_TXBCIE_CFIE20                 0x00100000
#define REG_BITS_MCAN_TXBCIE_CFIE19                 0x00080000
#define REG_BITS_MCAN_TXBCIE_CFIE18                 0x00040000
#define REG_BITS_MCAN_TXBCIE_CFIE17                 0x00020000
#define REG_BITS_MCAN_TXBCIE_CFIE16                 0x00010000
#define REG_BITS_MCAN_TXBCIE_CFIE15                 0x00008000
#define REG_BITS_MCAN_TXBCIE_CFIE14                 0x00004000
#define REG_BITS_MCAN_TXBCIE_CFIE13                 0x00002000
#define REG_BITS_MCAN_TXBCIE_CFIE12                 0x00001000
#define REG_BITS_MCAN_TXBCIE_CFIE11                 0x00000800
#define REG_BITS_MCAN_TXBCIE_CFIE10                 0x00000400
#define REG_BITS_MCAN_TXBCIE_CFIE9                  0x00000200
#define REG_BITS_MCAN_TXBCIE_CFIE8                  0x00000100
#define REG_BITS_MCAN_TXBCIE_CFIE7                  0x00000080
#define REG_BITS_MCAN_TXBCIE_CFIE6                  0x00000040
#define REG_BITS_MCAN_TXBCIE_CFIE5                  0x00000020
#define REG_BITS_MCAN_TXBCIE_CFIE4                  0x00000010
#define REG_BITS_MCAN_TXBCIE_CFIE3                  0x00000008
#define REG_BITS_MCAN_TXBCIE_CFIE2                  0x00000004
#define REG_BITS_MCAN_TXBCIE_CFIE1                  0x00000002
#define REG_BITS_MCAN_TXBCIE_CFIE0                  0x00000001
//*****************************************************************************


//*****************************************************************************
// Device Register Bit Field Defines
//*****************************************************************************

// Modes of Operation and Pin Configuration Registers (0x0800)
// Generic masks
#define REG_BITS_DEVICE_MODE_FORCED_SET_BITS        0x00000020

// Wake pin
#define REG_BITS_DEVICE_MODE_WAKE_PIN_MASK          0xC0000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_DIS           0x00000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_RISING        0x40000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_FALLING       0x80000000
#define REG_BITS_DEVICE_MODE_WAKE_PIN_BOTHEDGES     0xC0000000

// WD_Timer (If applicable)
#define REG_BITS_DEVICE_MODE_WD_TIMER_MASK          0x30000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_60MS          0x00000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_600MS         0x10000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_3S            0x20000000
#define REG_BITS_DEVICE_MODE_WD_TIMER_6S            0x30000000

// WD_TIMER_CLK_REF
#define REG_BITS_DEVICE_MODE_WD_CLK_MASK            0x08000000
#define REG_BITS_DEVICE_MODE_WD_CLK_20MHZ           0x00000000
#define REG_BITS_DEVICE_MODE_WD_CLK_40MHZ           0x08000000

// GPO2 Pin Configuration
#define REG_BITS_DEVICE_MODE_GPO2_MASK              0x00C00000
#define REG_BITS_DEVICE_MODE_GPO2_CAN_FAULT         0x00000000
#define REG_BITS_DEVICE_MODE_GPO2_MCAN_INT0         0x00400000
#define REG_BITS_DEVICE_MODE_GPO2_WDT               0x00800000
#define REG_BITS_DEVICE_MODE_GPO2_NINT              0x00C00000

// Test Mode Enable Bit
#define REG_BITS_DEVICE_MODE_TESTMODE_ENMASK        0x00200000
#define REG_BITS_DEVICE_MODE_TESTMODE_EN            0x00200000
#define REG_BITS_DEVICE_MODE_TESTMODE_DIS           0x00000000

// nWKRQ Pin GPO Voltage Rail COnfiguration
#define REG_BITS_DEVICE_MODE_NWKRQ_VOLT_MASK        0x00080000
#define REG_BITS_DEVICE_MODE_NWKRQ_VOLT_INTERNAL    0x00000000
#define REG_BITS_DEVICE_MODE_NWKRQ_VOLT_VIO         0x00080000

// WD_BIT
#define REG_BITS_DEVICE_MODE_WDT_RESET_BIT          0x00040000

// WD_ACTION
#define REG_BITS_DEVICE_MODE_WDT_ACTION_MASK        0x00020000
#define REG_BITS_DEVICE_MODE_WDT_ACTION_INT         0x00000000
#define REG_BITS_DEVICE_MODE_WDT_ACTION_INH_PULSE   0x00010000
#define REG_BITS_DEVICE_MODE_WDT_ACTION_WDT_PULSE   0x00020000

// CLKOUT/GPO1 Pin Mode Select
#define REG_BITS_DEVICE_MODE_GPO1_MODE_MASK         0x0000C000
#define REG_BITS_DEVICE_MODE_GPO1_MODE_GPO          0x00000000
#define REG_BITS_DEVICE_MODE_GPO1_MODE_CLKOUT       0x00004000
#define REG_BITS_DEVICE_MODE_GPO1_MODE_GPI          0x00008000

// Fail Safe Enable
#define REG_BITS_DEVICE_MODE_FAIL_SAFE_MASK         0x00002000
#define REG_BITS_DEVICE_MODE_FAIL_SAFE_EN           0x00002000
#define REG_BITS_DEVICE_MODE_FAIL_SAFE_DIS          0x00000000

// CLKOUT Prescaler
#define REG_BITS_DEVICE_MODE_CLKOUT_MASK            0x00001000
#define REG_BITS_DEVICE_MODE_CLKOUT_DIV1            0x00000000
#define REG_BITS_DEVICE_MODE_CLKOUT_DIV2            0x00001000

// GPO1 Function Select
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_MASK         0x00000C00
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_SPI_INT      0x00000000
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_MCAN_INT1    0x00000400
#define REG_BITS_DEVICE_MODE_GPO1_FUNC_UVLO_THERM   0x00000800

// INH Pin Disable
#define REG_BITS_DEVICE_MODE_INH_MASK               0x00000200
#define REG_BITS_DEVICE_MODE_INH_DIS                0x00000200
#define REG_BITS_DEVICE_MODE_INH_EN                 0x00000000

// nWKRQ Pin Configuration
#define REG_BITS_DEVICE_MODE_NWKRQ_CONFIG_MASK      0x00000100
#define REG_BITS_DEVICE_MODE_NWKRQ_CONFIG_INH       0x00000000
#define REG_BITS_DEVICE_MODE_NWKRQ_CONFIG_WKRQ      0x00000100

// Mode of Operation
#define REG_BITS_DEVICE_MODE_DEVICEMODE_MASK        0x000000C0
#define REG_BITS_DEVICE_MODE_DEVICEMODE_SLEEP       0x00000000
#define REG_BITS_DEVICE_MODE_DEVICEMODE_STANDBY     0x00000040
#define REG_BITS_DEVICE_MODE_DEVICEMODE_NORMAL      0x00000080

// WDT_EN
#define REG_BITS_DEVICE_MODE_WDT_MASK               0x00000008
#define REG_BITS_DEVICE_MODE_WDT_EN                 0x00000008
#define REG_BITS_DEVICE_MODE_WDT_DIS                0x00000000

