andeyqi/CAN_FD/bsp/stm32/stm32f446-st-nucleo/applications/tcan4x5x/TCAN4x5x_Reg.h
// Dev Reset
#define REG_BITS_DEVICE_MODE_DEVICE_RESET           0x00000004

// SWE_DIS: Sleep Wake Error Disable
#define REG_BITS_DEVICE_MODE_SWE_MASK               0x00000002
#define REG_BITS_DEVICE_MODE_SWE_DIS                0x00000002
#define REG_BITS_DEVICE_MODE_SWE_EN                 0x00000000

// Test Mode Configuration
#define REG_BITS_DEVICE_MODE_TESTMODE_MASK          0x00000001
#define REG_BITS_DEVICE_MODE_TESTMODE_PHY           0x00000000
#define REG_BITS_DEVICE_MODE_TESTMODE_CONTROLLER    0x00000001


// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Device Interrupt Register values (0x0820)
#define REG_BITS_DEVICE_IR_CANLGND                  0x08000000
#define REG_BITS_DEVICE_IR_CANBUSOPEN               0x04000000
#define REG_BITS_DEVICE_IR_CANBUSGND                0x02000000
#define REG_BITS_DEVICE_IR_CANBUSBAT                0x01000000
//Reserved                                          0x00800000
#define REG_BITS_DEVICE_IR_UVSUP                    0x00400000
#define REG_BITS_DEVICE_IR_UVIO                     0x00200000
#define REG_BITS_DEVICE_IR_PWRON                    0x00100000
#define REG_BITS_DEVICE_IR_TSD                      0x00080000
#define REG_BITS_DEVICE_IR_WDTO                     0x00040000
//Reserved                                          0x00020000
#define REG_BITS_DEVICE_IR_ECCERR                   0x00010000
#define REG_BITS_DEVICE_IR_CANINT                   0x00008000
#define REG_BITS_DEVICE_IR_LWU                      0x00004000
#define REG_BITS_DEVICE_IR_WKERR                    0x00002000
#define REG_BITS_DEVICE_IR_FRAME_OVF                0x00001000
//Reserved                                          0x00000800
#define REG_BITS_DEVICE_IR_CANSLNT                  0x00000400
//Reserved                                          0x00000200
#define REG_BITS_DEVICE_IR_CANDOM                   0x00000100
#define REG_BITS_DEVICE_IR_GLOBALERR                0x00000080
#define REG_BITS_DEVICE_IR_nWKRQ                    0x00000040
#define REG_BITS_DEVICE_IR_CANERR                   0x00000020
#define REG_BITS_DEVICE_IR_CANBUSFAULT              0x00000010
#define REG_BITS_DEVICE_IR_SPIERR                   0x00000008
#define REG_BITS_DEVICE_IR_SWERR                    0x00000004
#define REG_BITS_DEVICE_IR_M_CAN_INT                0x00000002
#define REG_BITS_DEVICE_IR_VTWD                     0x00000001

// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// Device Interrupt Enable Values (0x0830)
#define REG_BITS_DEVICE_IE_UVCCOUT                  0x00800000
#define REG_BITS_DEVICE_IE_UVSUP                    0x00400000
#define REG_BITS_DEVICE_IE_UVIO                     0x00200000
#define REG_BITS_DEVICE_IE_PWRON                    0x00100000
#define REG_BITS_DEVICE_IE_TSD                      0x00080000
#define REG_BITS_DEVICE_IE_WDTO                     0x00040000
// Reserved
#define REG_BITS_DEVICE_IE_ECCERR                   0x00010000
#define REG_BITS_DEVICE_IE_CANINT                   0x00008000
#define REG_BITS_DEVICE_IE_LWU                      0x00004000
#define REG_BITS_DEVICE_IE_WKERR                    0x00002000
#define REG_BITS_DEVICE_IE_FRAME_OVF                0x00001000
//Reserved                                          0x00000800
#define REG_BITS_DEVICE_IE_CANSLNT                  0x00000400
//Reserved                                          0x00000200
#define REG_BITS_DEVICE_IE_CANDOM                   0x00000100
// Reserved                                         0x80-00
//#define REG_BITS_DEVICE_IE_MASK                     0xFF69D700
#define REG_BITS_DEVICE_IE_MASK                     0x0069D700


#endif /* TCAN4X5X_REG_H_ */
